---
kind: type
id: T:Autodesk.Revit.DB.BackgroundSettings
source: html/eb7238e2-39df-d7eb-48c6-edd7a38b2a0e.htm
---
# Autodesk.Revit.DB.BackgroundSettings

Represents the rendering background settings.

## Syntax (C#)
```csharp
public class BackgroundSettings : IDisposable
```